app/views/quotes/_form.html.erb

          <%= category_form.label :category_id, "Category", class: "form-label d-inline-block me-2" %>
          <%= category_form.select :category_id, Category.all.collect { |cat| [cat.categoryName, cat.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT "categories".* FROM "categories"