app/views/quotes/index.html.erb

        <% quote.categories.each_with_index do |category, index| %>
          <%= category.categoryName %><%= ", " unless index == quote.categories.size - 1 %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 5]]