app/views/quotes/show.html.erb

<%#  Display the quote categories as headings %>
<% @quote.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 5]]