app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?)  [["id", 3], ["id", 4], ["id", 1], ["id", 5]]
SELECT "quote_categories".* FROM "quote_categories" WHERE "quote_categories"."quote_id" IN (?, ?, ?, ?, ?)  [["quote_id", 12], ["quote_id", 11], ["quote_id", 10], ["quote_id", 6], ["quote_id", 5]]
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @quotes = Quote.includes(categories: :quote_categories).order(created_at: :desc).take(5)

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 1], ["id", 4], ["id", 2]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ? ORDER BY "quotes"."created_at" DESC  [["user_id", 3]]
---
  def uquotes
    @quotes = Quote.includes(:categories).where(user_id: session[:user_id]).order(created_at: :desc)