app/controllers/philosophers_controller.rb

SELECT "philosophers".* FROM "philosophers"
---
  def index
    @philosophers = Philosopher.all

INSERT INTO "philosophers" ("fname", "lname", "birthYear", "deathYear", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @philosopher = Philosopher.new(philosopher_params)

    respond_to do |format|
      if @philosopher.save

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_philosopher
      @philosopher = Philosopher.find(params[:id])