app/controllers/quotes_controller.rb

  def index
  # Retrieve quotes belonging to the current user and order them by creation date in descending order
    @quotes = current_user.quotes.order(created_at: :desc) # To prevent users from editing or deleting other user's quotes
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ? ORDER BY "quotes"."created_at" DESC  [["user_id", 4]]

  def create
    Rails.logger.debug "Submitted parameters: #{params.inspect}"
    @quote = Quote.new(quote_params) # To initialize a new quote object
    if @quote.save
---
INSERT INTO "quotes" ("quoteText", "publicationYear", "comment", "isPublic", "user_id", "philosopher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @quote.update(quote_params)
---
UPDATE "quotes" SET "comment" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["comment", ""], ["updated_at", "2024-05-15 20:04:31.432332"], ["id", 5]]

  def set_philosophers
    @philosophers = Philosopher.all.order(:fname)
---
SELECT "philosophers".* FROM "philosophers" ORDER BY "philosophers"."fname" ASC