app/controllers/search_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 1], ["id", 4]]
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (quotes.quoteText LIKE '%Ethics%' OR categories.categoryName LIKE '%Ethics%')
---
  def index
    category_query = params[:category_query] #    # To retrieve the category query parameter
 # Search for quotes that match the entered category query
    @quotematch = Quote.includes(:categories).joins(quote_categories: :category).where("quotes.quoteText LIKE :query OR categories.categoryName LIKE :query", query: "%#{category_query}%").distinct