app/controllers/users_controller.rb

  def index
    if logged_in? && is_administrator? # If there is a logged in user and that user is an administrator
    @users = User.all # Then retrieve all users from the database
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "isAdmin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)